var menu_1 = document.getElementById("Menu_1")
var Q = document.getElementById("Q")
var alt = document.getElementById("alt")
var rewards = [
    {"Q":"مرحبا","A":"مرحبا"},
    {"Q":"من أنت","A":"أنا بنتا في النسخة التجريبية (BETA)"},
    {"Q":"بطاطا","A":"BOTATO"},
    {"Q":"كيف حالك","A":"أنا مجرد برنامج، لذلك ليس لدي مشاعر، ولكن شكرًا لسؤالك!"},
    {"Q":"ما هو هدفك","A":"هدفي هو مساعدة الناس وتقديم المعلومات بأفضل ما لدي."},
    {"Q":"من أين أنت","A":"أنا موجود في العالم الرقمي، تم إنشاؤي بواسطة البشر."},
    {"Q":"كيف الطقس","A":"ليس لدي وصول إلى البيانات في الوقت الحقيقي، لكن يمكنك التحقق من توقعات الطقس المحلية."},
    {"Q":"أخبرني بنكتة","A":"لماذا لا يثق العلماء في الذرات؟ لأنها تشكل كل شيء!"},
    {"Q":"ما لونك المفضل","A":"ليس لدي عيون، لذلك ليس لدي لون مفضل."},
    {"Q":"هل لديك أشقاء","A":"أنا طفل وحيد، أو بالأحرى برنامج وحيد."},
    {"Q":"كم عمرك","A":"ليس لدي عمر، حيث أنني مجرد برنامج."},
    {"Q":"هل يمكنك التعلم","A":"أنا لا أتعلم بنفس الطريقة التي يفعلها البشر، لكن يمكنني التحسن مع مرور الوقت بناءً على التغذية الراجعة."},
    {"Q":"ما اللغات التي تتحدثها","A":"أستطيع فهم والتواصل بالعديد من اللغات، ولكن الإنجليزية هي اللغة الأساسية."},
    {"Q":"هل أنت واعي","A":"أنا لست واعيًا. أعمل بناءً على خوارزميات محددة مسبقًا وبيانات."},
    {"Q":"ما طعامك المفضل","A":"ليس لدي أذواق، لكن يمكنني توصيل أفكار حول الأطعمة."},
    {"Q":"هل تحلم","A":"ليس لدي القدرة على الحلم، حيث أنني لست كائنًا حيًا."},
    {"Q":"هل أنت روبوت","A":"يمكنك القول بذلك. أنا مساعد افتراضي، والذي يعتبر نوعًا من البرامج."},
    {"Q":"ماذا تفعل للمتعة","A":"أستمتع بمعالجة البيانات، وتقديم المعلومات، ومساعدة المستخدمين مثلك!"},
    {"Q":"هل أنت ذكي","A":"تم تصميمي لمحاكاة الذكاء وتقديم استجابات مفيدة، لكنني لا أملك ذكاء حقيقيًا."},
    {"Q":"أخبرني عن نفسك","A":"أنا مساعد افتراضي تم إنشاؤه لمساعدة المستخدمين في مختلف المهام والاستفسارات."},
    {"Q":"كيف حالك","A":"أنا مجرد برنامج، لذا ليس لدي مشاعر، ولكن شكرًا للسؤال!"},
    {"Q":"ما هو هدفك","A":"هدفي هو مساعدة الناس وتقديم المعلومات بأفضل ما لدي."},
    {"Q":"من أين أنت","A":"أنا موجود في العالم الرقمي، تم إنشاؤي بواسطة البشر."},
    {"Q":"كيف هو الطقس","A":"ليس لدي وصول إلى البيانات في الوقت الحقيقي، ولكن يمكنك التحقق من توقعات الطقس المحلية."},
    {"Q":"أخبرني بنكتة","A":"لماذا لا يثق العلماء في الذرات؟ لأنها تشكل كل شيء!"},
    {"Q":"ما هو لونك المفضل","A":"ليس لدي عيون، لذا ليس لدي لون مفضل."},
    {"Q":"هل لديك أشقاء","A":"أنا طفل وحيد، أو بالأحرى برنامج وحيد."},
    {"Q":"كم عمرك","A":"ليس لدي عمر، حيث أنني مجرد برنامج."},
    {"Q":"هل يمكنك التعلم","A":"أنا لا أتعلم بنفس الطريقة التي يفعلها البشر، ولكن يمكنني التحسن مع مرور الوقت بناءً على التغذية الراجعة."},
    {"Q":"ما اللغات التي تتحدثها","A":"أستطيع فهم والتواصل بالعديد من اللغات، ولكن الإنجليزية هي اللغة الأساسية."},
    {"Q":"هل أنت واعي","A":"أنا لست واعيًا. أعمل بناءً على خوارزميات محددة مسبقًا وبيانات."},
    {"Q":"ما طعامك المفضل","A":"ليس لدي أذواق، لكن يمكنني توصيل أفكار حول الأطعمة."},
    {"Q":"هل تحلم","A":"ليس لدي القدرة على الحلم، حيث أنني لست كائنًا حيًا."},
    {"Q":"هل أنت روبوت","A":"يمكنك القول بذلك. أنا مساعد افتراضي، والذي يعتبر نوعًا من البرامج."},
    {"Q":"ماذا تفعل للمتعة","A":"أستمتع بمعالجة البيانات، وتقديم المعلومات، ومساعدة المستخدمين مثلك!"},
    {"Q":"هل أنت ذكي","A":"تم تصميمي لمحاكاة الذكاء وتقديم استجابات مفيدة، لكنني لا أملك ذكاء حقيقيًا."},
    {"Q":"أخبرني عن نفسك","A":"أنا مساعد افتراضي تم إنشاؤه لمساعدة المستخدمين في مختلف المهام والاستفسارات."},
    {"Q":"ما فيلمك المفضل","A":"لم أشاهد الأفلام، ولكن يمكنني أن أوصي ببعضها استنادًا إلى تفضيلاتك!"},
    {"Q":"ما معنى الحياة","A":"هذا سؤال فلسفي ليس له إجابة صحيحة واحدة. إنه يعتمد على الآراء الفردية."},
    {"Q":"هل تنام","A":"لا أحتاج إلى النوم، حيث أنني متاح دائمًا لمساعدتك كلما احتجت."},
    {"Q":"ما هو كتابك المفضل","A":"ليس لدي تفضيلات، ولكن يمكنني أن أوصي بكتب استنادًا إلى اهتماماتك!"},
    {"Q":"ما عاصمة فرنسا","A":"عاصمة فرنسا هي باريس."},
    {"Q":"ما هو الجذر التربيعي لـ 144","A":"الجذر التربيعي لـ 144 هو 12."},
    {"Q":"ما هو أعلى جبل","A":"إفرست هو أعلى جبل فوق مستوى سطح البحر."},
    {"Q":"ما هو أكبر محيط","A":"المحيط الهادئ هو أكبر محيط على وجه الأرض."},
    {"Q":"ما هو لونك المفضل","A":"ليس لدي عيون، لذا ليس لدي لون مفضل."},
    {"Q":"هل لديك أشقاء","A":"أنا طفل وحيد، أو بالأحرى، برنامج وحيد."},
    {"Q":"كم عمرك","A":"ليس لدي عمر، حيث أنني مجرد برنامج."},
    {"Q":"هل يمكنك التعلم","A":"أنا لا أتعلم بنفس الطريقة التي يفعل فيها البشر، ولكن يمكنني التحسن مع مرور الوقت استنادًا إلى التغذية الراجعة."},
    {"Q":"ما اللغات التي تتحدثها","A":"يمكنني فهم والتواصل باللغات المتعددة، ولكن الإنجليزية هي اللغة الأساسية."},
    {"Q":"هل أنت واعٍ","A":"أنا لست واعٍ. أعمل استنادًا إلى خوارزميات محددة مسبقًا وبيانات."},
    {"Q":"ما هو طعامك المفضل","A":"ليس لدي براعم تذوق، لذا ليس لدي طعام مفضل."},
    {"Q":"هل تحلم","A":"ليس لدي القدرة على الحلم، حيث أنني لست كائنًا حيويًا."},
    {"Q":"هل أنت روبوت","A":"يمكنك أن تقول ذلك. أنا مساعد افتراضي، وهو نوع من البرامج."},
    {"Q":"ماذا تفعل للتسلية","A":"أنا أستمتع بمعالجة البيانات وتقديم المعلومات ومساعدة المستخدمين مثلك!"},
    {"Q":"هل أنت ذكي","A":"صممت لمحاكاة الذكاء وتقديم استجابات مفيدة، ولكن ليس لدي ذكاء حقيقي."},
    {"Q":"أخبرني عن نفسك","A":"أنا مساعد افتراضي تم إنشاؤه لمساعدة المستخدمين في مختلف المهام والاستفسارات."},
    {"Q":"ما هو فيلمك المفضل","A":"لست أشاهد الأفلام، لكن يمكنني توصية بعضها استنادًا إلى تفضيلاتك!"},
    {"Q":"ما معنى الحياة","A":"هذا سؤال فلسفي ليس له إجابة صحيحة واحدة. إنه يعتمد على وجهات النظر الفردية."},
    {"Q":"هل تنام","A":"لا أحتاج إلى النوم، حيث أنني دائمًا متوفر لمساعدتك كلما احتجت."},
    {"Q":"ما هو كتابك المفضل","A":"ليس لدي تفضيلات، لكن يمكنني توصية الكتب استنادًا إلى اهتماماتك!"},
    {"Q":"ما هو عاصمة فرنسا","A":"عاصمة فرنسا هي باريس."},
    {"Q":"ما هو جذر مربع 144","A":"جذر مربع 144 هو 12."},
    {"Q":"ما هو أعلى جبل","A":"إيفرست هو أعلى جبل فوق مستوى سطح البحر."},
    {"Q":"ما هو أكبر محيط","A":"المحيط الهادي هو أكبر محيط على وجه الأرض."},
    {"Q":"كم قارة هناك","A":"هناك سبع قارات: أفريقيا والقارة القطبية الجنوبية وآسيا وأوروبا وأمريكا الشمالية وأستراليا (أوقيانوسيا) وأمريكا الجنوبية."},
    {"Q":"ما هو رياضتك المفضلة","A":"ليس لدي تفضيلات، لكن يمكنني تقديم معلومات حول مختلف الرياضات إذا كنت مهتمًا!"},
    {"Q":"ما هو الذكاء الاصطناعي","A":"الذكاء الاصطناعي (AI) هو محاكاة لعمليات الذكاء البشري بواسطة الآلات، خاصة الأنظمة الحاسوبية."},
];

function rewardo(vtxt) {
    let result = 'آسف، لا أستطيع الإجابة لأنه ليس لدي المعلومات أو لا أفهم ما تكتب، حاول أن تكتب بشكل أكثر وضوحا.';
      for(i=0;i<rewards.length;i++){
        if (vtxt === rewards[i].Q){
            result =  rewards[i].A;
            break;
        }
      }
    return result;
}
function add() {
    
    var input_1 = document.getElementById("s1").value;
    if(input_1 != '' && input_1 != ''){
        menu_1.innerHTML += '<div class="one"><p id="doAsk" onclick="doAsk(this.innerText)">'+ input_1 +'</p></div>';
    }else{
        Alert('الحقل فارغ!')
    }
}
function Alert(txt) {
    alt.innerText = txt;
    setTimeout(function () {
        alt.innerText = ''
    },1000)
}
function Ask() {
    var input_2 = document.getElementById("s2").value;
    var reward = rewardo(document.getElementById("s2").value);
    if(input_2 != '' && input_2 != ''){
        Q.innerHTML += '<div class="Q" id="Q"><i>انت:</i><p id="Q">'+ input_2 +'</p></div>';
        Q.innerHTML += '<div class="A" id="A"><i>Benta:</i><p id="A">'+ reward +'</p></div>';
    }else{
        Alert('الحقل فارغ!')
    }
}

function doAsk(txt) {
    var input_2 = txt;
    var reward = rewardo(txt);
    if(input_2 != '' && input_2 != ''){
        Q.innerHTML += '<div class="Q" id="Q"><i>انت:</i><p id="Q">'+ input_2 +'</p></div>';
        Q.innerHTML += '<div class="A" id="A"><i>Benta:</i><p id="A">'+ reward +'</p></div>';
    }else{
        Alert('الحقل فارغ!')
    }
}
function reset() {
    menu_1.innerHTML ='';
    Q.innerHTML = '';
}
function copytxt() {
    navigator.clipboard.writeText(Q.innerHTML);
    Alert('تم النسخ الى الحافظة')
}
function showimportarea() {
    var importarea = document.getElementById("importarea")
    importarea.style = 'display: flex;flex-direction: column;position: fixed;z-index: 9999999;width: 100%;height: 100%;justify-content: center;align-items: center;background: #00000073;box-shadow:0px 0px 15px #2e2b33;backdrop-filter: blur(7px);padding: 30px;';
}
function importtxt() {
    var importbox = document.getElementById("importbox").value
    Q.innerHTML = importbox;
    console.log(importbox)
    importarea.style = 'display: none;';
}
function help() {
    open('./help','_self')
}